N3b3x/hf-bno08x-driver/examples/esp32/sdkconfig.defaults
# ESP32-S3 BNO08x Driver Examples - Default Configuration
# This file sets default values that will be used when sdkconfig doesn't exist
# or when running 'idf.py reconfigure'

# Target configuration
CONFIG_IDF_TARGET="esp32s3"

# Main task stack size - increased to 16KB for printing and application tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# System event task stack size
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Timer task stack size
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# FreeRTOS idle task stack size
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# FreeRTOS timer task stack depth
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# ISR stack size
CONFIG_FREERTOS_ISR_STACKSIZE=2048

# TCP/IP task stack size
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096

# Pthread default stack size
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=16384

# Minimal shared stack size
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=4096

# IPC task stack size
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048

# Enable stack overflow checking
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# Enable hardware stack guard
CONFIG_ESP_SYSTEM_HW_STACK_GUARD=y
